{
    "userId": "183",
    "firstName": "Depala",
    "lastName": "Rajeswari",
    "jobTitle": "Software Engineer",
    "summary": "I am a dedicated Software Engineer and ML Engineer  with a passion for leveraging the transformative power of technology.Driven by a commitment to harness technology for positive change, I am focused on developing innovative solutions that create meaningful impacts.",
    "educations": [
        {
            "institution": "Illinois Institute Of Technology",
            "degree": "Master of Science",
            "fieldOfStudy": "Computer Science",
            "gpa": "3.3",
            "gelink": "https://1drv.ms/i/s!Ar51jB7fiEKQoaMp28KnDyaHI3pCFg?e=kYLChs",
            "startDate": "2023-01-20",
            "endDate": "2024-12-15",
            "coursesTaken": [
                { "name": "Deep Learning", "code": "CS577" },
                { "name": "Machine Learning", "code": "CS480" },
                { "name": "Theory Of Computation", "code": "CS530" },
                { "name": "Advanced Database Organization", "code": "CS525" },
                { "name": "Data Preparation and Analysis", "code": "CS55" }
            ],
            "description": "This program immersed me in a dynamic blend of AI, machine learning, computational theory, advanced database systems, and data analysis. It has equipped me with the analytical and technical prowess to tackle complex challenges and devise innovative, cutting-edge solutions."
        },
        {
            "institution": "Vidya Jyothi Institute Of Technology",
            "degree": "Bachelor of Technology",
            "fieldOfStudy": "Software Engineering",
            "gpa": "3.8",
            "gelink": "https://1drv.ms/i/s!Ar51jB7fiEKQoaModGMdFZQKQe0hhQ?e=A3BsiD",
            "startDate": "2018-06-01",
            "endDate": "2022-06-27",
            "coursesTaken": [
                { "name": "Data Structures", "code": "SE501" },
                { "name": "Database Management Systems", "code": "SE502" },
                { "name": "Web Technologies", "code": "SE503" }
            ],
            "description": "This program offered an in-depth exploration of software engineering, merging theoretical foundations with practical applications. It equipped me with advanced technical expertise and a creative problem-solving mindset, priming me to excel and innovate in the dynamic field of technology."
        }
    ],
    "experiences": [
        {
            "jobTitle": "Associate Engineer",
            "company": "Virtusa",
            "location": "Hyderabad,India",
            "startDate": "2022-05-17",
            "endDate": "2022-12-31",
            "toolsLearnt": ["Selenium", "TestNG", "JUnit"],
            "description": "Developed both  manual and automated test scripts using Selenium, TestNG, JUnit, and Maven, conducting over 500 regression tests to ensure seamless functionality of existing features and proactively identifying potential issues, resulting in a 30% reduction in post-release defects.Orchestrated comprehensive test documentation, encompassing detailed plans, 1,000+ test cases, and traceable reports, significantly enhancing traceability and maintaining stringent quality assurance standards, which improved overall project integrity and delivery timelines by 25%."
        },
        {
            "jobTitle": "Intern Delivery",
            "company": "Virtusa",
            "location": "Hyderabad,India",
            "startDate": "2022-02-17",
            "endDate": "2022-04-31",
            "toolsLearnt": ["Java Springboot", "AngularJS", "Selenium", "HTML","CSS"],
            "description": "Innovatively architected and implemented a user-centric interface for the application using Angular and Java Spring Boot, revolutionizing the ground facility reservation process with a real-time booking system that reduced booking times by 60%. Leveraged the powerful combination of Angular for dynamic front-end development and Spring Boot for robust back-end support, ensuring a seamless and responsive user experience.Designed and developed a sophisticated, user-friendly UI that boosted user engagement by 40%. The interface's sleek design and intuitive navigation enhanced usability, while rigorous validation of over 200 manual test cases ensured a flawless, bug-free experience. This meticulous attention to detail significantly improved overall user satisfaction and reliability of the application, showcasing a high standard of quality and innovation in front-end development."
        },
        {
            "jobTitle": "Data Science and Buisness Analyst",
            "company": "The Sparks Foundation ",
            "location": "Hyderabad,India",
            "startDate": "2021-04-17",
            "endDate": "2021-05-31",
            "toolsLearnt": ["Python"],
            "description": "I completed a project focused on predicting the optimal number of clusters in the Iris dataset using K-means clustering.Initial exploratory data analysis (EDA) was performed to understand the dataset better. The K-means algorithm was then applied, and the Elbow method was used to determine the optimal number of clusters. The results were visualized through various plots, which demonstrated the separations of the clusters and allowed for comparisons with the actual species in the dataset.I skillfully intertwined code and explanatory markdown cells to craft a vivid and insightful narrative of the clustering journey."
        }
    ],
    "projects": [
        {
            "title": "Handwriting Word Recognition",
            "description": "Harnessing a comprehensive dataset of over 115,000 images, enriched by the diverse perspectives of 657 writers, I developed a state-of-the-art image recognition solution. This project focused on enhancing model performance through the innovative design of a bespoke Convolutional Recurrent Neural Network (CRNN) with an advanced attention mechanism.The application achieved remarkable results, boasting a Character Error Rate (CER) of 2.02% and a Word Error Rate (WER) of 5.71%. The model's development prioritized rigorous data augmentation, transfer learning, and meticulous hyperparameter optimization. Techniques such as dropout regularization and batch normalization were employed to fine-tune the model architecture, ensuring maximum performance.This avant-garde solution not only shattered baseline performance benchmarks but also significantly reduced errors by 2.13% (CER) and 4.07% (WER) compared to previous iterations, highlighting my expertise in cutting-edge machine learning methodologies and model optimization strategies..",
            "startDate": "2022-01-01",
            "endDate": "2022-03-01",
            "technologies": ["Pytorch", "Anaconda", "Python"],
            "role": "Developer",
            "glink": "https://github.com/steelydr/Deep-Learning--Handwriting-Recognition-",
            "drivelink": "https://drive.google.com/portfolio"
        },
        {
            "title": "EntertainTriplex",
            "description": "In my project, I seamlessly transformed the booking experience for movies, games, and concerts while empowering administrators with powerful visualization tools. MySQL handled data with unparalleled robustness and efficiency, managing over 1 million records daily. Spring Boot accelerated development and deployment, reducing time by 40% and providing a solid backbone for our platform. Postman ensured meticulous testing and documentation of over 500 API endpoints, guaranteeing reliability and transparency.On the user-facing side, I crafted a vibrant interface using React.js, increasing user satisfaction by 30%. Express.js enabled the creation of interactive charts and dashboards, processing over 200,000 data points daily and offering real-time insights to administrators for informed decisions and efficient management.",
            "startDate": "2024-02-02",
            "endDate": "2024-05-01",
            "technologies": ["Java Springboot", "Reactjs","Express.js","API Dog"],
            "role": "Full Stack Developer",
            "glink": "https://github.com/steelydr/Fullstack_",
            "drivelink": "https://drive.google.com/ecommerce-platform"
        },
        {
            "title": "Advanced Database Organization",
            "description": "Our project employed advanced indexing and query optimization techniques to enhance database performance. By leveraging bitmap indexes and partitioning strategies, we achieved significant improvements in query response times. Our extensive evaluation demonstrated the efficiency of these techniques, culminating in a robust and scalable database solution. Through continuous refinement, we optimized storage and retrieval processes, achieving superior performance. This project exemplifies the integration of innovative database management strategies to handle large-scale data efficiently, paving the way for more effective and reliable database applications.",
            "startDate": "2020-03-01",
            "endDate": "2020-08-01",
            "technologies": ["C", "Linux", "Oracle VM VirtualBox"],
            "role": "Team Leader",
            "glink": "https://github.com/steelydr/Advanced-Database-Organization/tree/main",
            "drivelink": "https://drive.google.com/churn-prediction"
        },
        {
            "title": "Film Data Insights",
            "description": "Our project used cutting-edge regularization techniques and model evaluation strategies to fine-tune and validate our recommendation models. Our best-performing model, which included user, movie, and movie age effects with regularization, achieved an RMSE of 0.86384 and a final validation RMSE of 0.86452. This significant reduction in error underscores the accuracy and reliability of our model. By continuously refining our algorithms, we achieved unparalleled performance in predicting movie ratings and preferences. Our System harnesses data-driven insights and innovative technologies to transform the way users discover movies, enhancing user engagement and satisfaction in the streaming industry.",
            "startDate": "2020-03-01",
            "endDate": "2020-08-01",
            "technologies": ["R"],
            "role": "Data Scientist",
            "glink": "https://github.com/steelydr/Movie-Recomendation-System/tree/main",
            "drivelink": "https://drive.google.com/churn-prediction"
        },
        {
            "title": "Secure Message",
            "description": "I developed an application, which seamlessly combines cutting-edge cryptographic methodologies with an intuitive, user-friendly interface. This application leverages RSA encryption with Optimal Asymmetric Encryption Padding (OAEP) and integrates SHA-256 hashing, establishing a formidable defense against unauthorized access to sensitive information.This application features advanced key management for secure encryption handling and robust data protection. Its meticulously designed interface ensures seamless and responsive user interactions, enhancing the overall user experience.By delivering a state-of-the-art solution that guarantees the confidentiality and integrity of sensitive communications, this application not only provides top-tier encryption capabilities but also enhances user experience. ",
            "startDate": "2021-05-01",
            "endDate": "2021-12-01",
            "technologies": ["Python", "Tkinter"],
            "role": "Developer",
            "glink": "https://github.com/steelydr/Cryptography-RSA-Algorithm/tree/main",
            "drivelink": "https://drive.google.com/ecommerce-platform"
        }
    ],
    "certifications": [
        {
            "name": "Microsoft Certified: Azure Fundamentals",
            "authority": "Microsoft",
            "licenseNumber": "D9ADC67C84400BF0",
            "startDate": "2023-08-06",
            "endDate": "2023-01-01",
            "url": "https://drive.google.com/file/d/1XJUzBJ8yE2r2uk6JWHxt8k_v--3iyTKG/view?pli=1"
        },
        {
            "name": "Foundation Level Certificate in Software Testing",
            "authority": "ISTQB",
            "licenseNumber": "CTFL-112435",
            "startDate": "2020-03-11",
            "endDate": "2022-01-01",
            "url": "https://drive.google.com/file/d/1Gkih3K38jAP1vThqDc80NwnXd7m35z7u/view"
        },
        {
            "name": "Qlik Sense Business Analyst Qualification",
            "authority": "Qlik",
            "licenseNumber": "QSCertificate_BA_vFeb2019",
            "startDate": "2022-01-01",
            "endDate": "2024-01-01",
            "url": "https://drive.google.com/file/d/1cW_7oTWn_iPXTXqJiJb-XE185ky5Pyfu/view"
        }
    ],
    "contact": {
        "email": "dsoni071rajeswari@gmail.com",
        "phone": "+1 312 459 3213",
        "linkedIn": "https://www.linkedin.com/in/rajeswarid/",
        "github": "https://github.com/steelydr",
        "address": {
            "street": "2727 Indiana Avenue Apt 109",
            "city": "Chicago",
            "state": "IL",
            "zip": "10001",
            "country": "USA"
        }
    },
    "skills": [
        { "name": "JavaScript", "proficiency": "Expert" },
        { "name": "React", "proficiency": "Advanced" },
        { "name": "Node.js", "proficiency": "Advanced" },
        { "name": "Python", "proficiency": "Expert" },
        { "name": "AWS", "proficiency": "Advanced" },
        { "name": "Docker", "proficiency": "Advanced" },
        { "name": "Kubernetes", "proficiency": "Intermediate" }
    ]
}
